print("\n//--------------------  复杂数据类型")
-- 所有的复杂类型都是Table 通过表来体现数据类型的特征
print("\n//--------------------  数组")
a = {} -- 空表
b = {1,2,3,4,5,6,7,nil}
c = {1,2,nil,"123",true,nil}

print(c[0],c[1])   -- lua中 索引从1开始

-- #是通用的获取长度关键字
print("#c",#c)  --  3打印长度时 nil被忽略
d = {1,2,nil,4,"123",true} -- 经验证 末尾的nil被忽略
print(#d)

print("\n//--------------------  数组的遍历")
for i =1,#d do
	print(d[i])
end

print("\n//--------------------  二维数组")

t = {
	{1,2,3},
	{4,5,6},
	{7,8,9}
}

print(t[1][2])  -- 2
print("\n//--------------------  二维数组遍历")
for i=1,#t do
	x = t[i]
	for j =1,#x do
		print (x[j]) 
	end
end



print("\n//--------------------  自定义索引")

aa = { [0] =1, 2,3,[-1]=4,5}
print(#aa) -- 长度为3 因为0，-1索引它不认识
print(aa[0])
print(aa[-1])


bb1 = {[1]=1,[2]=2,[4]=4,[5]=5} 
bb2 = {[1]=1,[2]=2,[5]=5,[6]=6}  -- 长度断了 为2
print(#bb1,#bb2)













